function htmlReport(sfile, gentype)
    load(sfile, '*');
    file = fullfile(pwd, 'results', ['solution_', gentype, '.html']);
    h = htmlBase;
    addhtml(file, 'w', h, '', '', '');
    h = ['<table class="cwdtable">\n' ...
        '<tr class="heighttr">\n' ...
        '<td colspan="2" class="boldtype">Расчет магнитной цепи</td>\n' ...
        '</tr>\n'];
    addhtml(file, 'a', h, '', '', '');
    addhtml(file, 'a', '', 'Коэффициент формы поля', '%1.3f', fkf);
    addhtml(file, 'a', '', ['Коэффициент поля, входящего в башмак ' ...
        'полюса'], '%1.3f', aklam);

    h = ['<tr class="heighttr">\n<td colspan="2">Коэффициенты  картера' ...
        '</td>\n</tr>\n'];
    addhtml(file, 'a', h, '', '', '');
    addhtml(file, 'a', '', 'Первый', '%1.3f', dkd1);
    addhtml(file, 'a', '', 'Второй', '%1.3f', dkd2);
    addhtml(file, 'a', '', 'Третий ', '%1.3f', dkd3);
    addhtml(file, 'a', '', 'Полный', '%1.3f', dkd);


    h = ['<tr class="heighttr" align="center">\n<td colspan="2">Расчет ' ...
        'проводимостей полюсов</td>\n</tr>\n'];
    addhtml(file, 'a', h, '', '', '');
    addhtml(file, 'a', '', 'АР', '%3.2f', ap);
    addhtml(file, 'a', '', 'ДТ', '%3.2f', dt);
    addhtml(file, 'a', '', 'СР', '%3.2f', cp);
    addhtml(file, 'a', '', 'Башмаков', '%3.3f', lampl);
    addhtml(file, 'a', '', 'Сердечников', '%3.3f', lamml);
    addhtml(file, 'a', '', 'Торцов', '%3.3f', lammb);
    addhtml(file, 'a', '', 'Суммарная', '%3.3f', lammp);
    addhtml(file, 'a', '', 'Полей рассеяния', '%3.3f', lamsig);
    addhtml(file, 'a', '', 'Индуктивное сопротивление Потье', '%3.4f', xp);
    addhtml(file, 'a', '', ['Расчетное индуктивное сопротивление ' ...
        'рассеяния'], '%3.4f', xp1);

    h = ['<tr class="heighttr" align="center">\n<td colspan="2">Расчет холостого хода ' ...
        'при номинальном напряжении</td>\n</tr>\n'];
    addhtml(file, 'a', h, '', '', '');
    addhtml(file, 'a', '', ['Первая гармоническая магнитного ' ...
        'потока'], '%3.4f', fi1n);
    addhtml(file, 'a', '', 'Магнитный поток на полюс', ...
        '%3.4f', fin);
    addhtml(file, 'a', '', ['Магнитный поток под полюсным ' ...
        'башмаком'], '%3.4f', filamn);

    addhtml(file, 'a', '', ['Электродвижущая сила'], '%6.0f', uftn);
    addhtml(file, 'a', '', ['Индукция в зазоре'], '%5.3f', bdeln);
    addhtml(file, 'a', '', ['Индукция в зубцах статора'], '%5.3f', bz3n);
    addhtml(file, 'a', '', ['Индукция в спинке статора'], '%5.3f', ban);
    addhtml(file, 'a', '', ['Напряженность поля в зубцах'], '%5.2f', awzn);
    addhtml(file, 'a', '', ['Напряженность поля в спинке статора'], '%5.2f', awan);

    addhtml(file, 'a', '', ['Коэффициент рассеяния полюсов'], '%5.3f', sigmn);
    addhtml(file, 'a', '', ['Коэффициент рассеяния  полюсных башмаков'], '%5.3f', sigpn);
    addhtml(file, 'a', '', ['Индукция в основании полюса'], '%5.3f', bmin);
    addhtml(file, 'a', '', ['Индукция в башмаке'], '%5.3f', bpin);
    addhtml(file, 'a', '', ['Индукция в среднем сечении полюса'], '%5.3f', bm12n);

    addhtml(file, 'a', '', ['Напряженность поля в основании'], '%5.2f', awt1n);
    addhtml(file, 'a', '', ['Напряженность поля в башмаке'], '%5.2f', awt3n);
    addhtml(file, 'a', '', ['Напряженность поля в среднем сечении'], '%5.2f', awt2n);
    addhtml(file, 'a', '', ['Напряженность поля эквивалентная'], '%5.2f', awmn);

    addhtml(file, 'a', '', ['МДС на зазор'], '%7.0f', awdn);
    addhtml(file, 'a', '', ['МДС на на зубцы статора'], '%7.0f', awzwn);
    addhtml(file, 'a', '', ['МДС на спинку статора'], '%7.0f', awawn);
    addhtml(file, 'a', '', ['МДС на полюса'], '%7.0f', awmwn);
    addhtml(file, 'a', '', ['МДС на стык полюча с ободом'], '%7.0f', awcn);
    addhtml(file, 'a', '', ['МДС на обод ротора'], '%7.0f', awjn);
    addhtml(file, 'a', '', ['Суммарная МДС'], '%7.0f', awsumn);

    addhtml(file, 'a', '', ['Ток холостого хода'], '%7.0f', hhin);
    addhtml(file, 'a', '', ['Ток холостого хода'], '%7.0f', uuf);

    addhtml(file, 'a', '', ['МДС реакции якоря'], '%7.0f', awapr);
    addhtml(file, 'a', '', ['МДС реакции якоря по продольной оси'], '%7.0f', awad);
    addhtml(file, 'a', '', ['МДС короткого замыкания'], '%7.0f', awk);

    addhtml(file, 'a', '', ['Коэффициенты реакции якоря ' ...
        'по продольной оси'], '%6.3f', kad);
    addhtml(file, 'a', '', ['Коэффициенты реакции якоря ' ...
        'по поперечной оси'], '%6.3f', kaq);
    addhtml(file, 'a', '', ['Эквивалентное открытие паза ' ...
        'для закрытых стержней'], '%6.2f', bs1);
    addhtml(file, 'a', '', ['Проводимость пазов открытых'], '%6.2f', lamot);
    addhtml(file, 'a', '', ['Проводимость пазов закрытых'], '%6.2f', lamz);
    addhtml(file, 'a', '', ['Проводимость пазов средняя'], '%6.2f', lamsr);

    h = ['<tr class="heighttr" align="center">\n<td colspan="2">' ...
        'Активные сопротивления</td>\n</tr>\n'];
    addhtml(file, 'a', h, '', '', '');
    addhtml(file, 'a', '', ['Обмотки якоря'], '%8.5f', rast);
    addhtml(file, 'a', '', ['Прямой последовательности'], '%8.5f', r1);
    addhtml(file, 'a', '', ['Обратной последовательности'], '%8.5f', r2);
    addhtml(file, 'a', '', ['Обмотки возбуждения'], '%8.6f', rf);
    addhtml(file, 'a', '', ['Демпферной обмотки по продольной оси'], '%8.4f', rkd);
    addhtml(file, 'a', '', ['Демпферной обмотки по поперечной оси'], '%8.4f', rkq);

    h = ['<tr class="heighttr" align="center">\n<td colspan="2">' ...
        'Индуктивные сопротивления</td>\n</tr>\n'];
    addhtml(file, 'a', h, '', '', '');
    addhtml(file, 'a', '', 'Рассеяния обмотки якоря', '%8.3f', xl);
    addhtml(file, 'a', '', ['Реакции якоря по продольной оси'], '%8.3f', xad);
    addhtml(file, 'a', '', ['Реакции якоря по поперечной оси'], '%8.3f', xaq);
    addhtml(file, 'a', '', ['Синхронное по продольной оси'], '%8.3f', xd);
    addhtml(file, 'a', '', ['Синхронное по поперечной оси'], '%8.3f', xq);
    addhtml(file, 'a', '', ['Полное обмотки возбуждения'], '%8.3f', xf);
    addhtml(file, 'a', '', ['Рассеяния обмотки возбуждения'], '%8.3f', xfras);
    addhtml(file, 'a', '', ['Переходное по продольной оси'], '%8.3f', xd1);
    addhtml(file, 'a', '', ['Рассеяний демпферной обмотки по продольной оси'], '%8.3f', xkd);
    addhtml(file, 'a', '', ['Рассеяний демпферной обмотки по поперечной оси'], '%8.3f', xkq);
    addhtml(file, 'a', '', ['Сверхпереходное по продольной оси'], '%8.3f', xd2p);
    addhtml(file, 'a', '', ['Сверхпереходное по поперечной оси'], '%8.3f', xq2p);
    addhtml(file, 'a', '', ['Обратной последовательности'], '%8.3f', x2);
    addhtml(file, 'a', '', ['Нулевой последовательности'], '%8.4f', x0);

    h = ['<tr class="heighttr" align="center">\n<td colspan="2">' ...
        'Постоянные времени</td>\n</tr>\n'];
    addhtml(file, 'a', h, '', '', '');
    addhtml(file, 'a', '', ['Обмотки возбуждения при разомкнутой ' ...
        'обмотке якоря'], '%5.2f', td01);
    addhtml(file, 'a', '', ['Обмотки возбуждения при ' ...
        'короткозамкнутой обмотке якоря'], '%5.2f', td1);
    addhtml(file, 'a', '', ['Обмотки якоря при короткозамкнутых ' ...
        'обмотках ротора'], '%5.3f', ta);
    addhtml(file, 'a', '', ['Демпферной обмотки по продольной оси' ...                            
        'при разомкнутых обмотках якоря и возбуждения'], '%5.3f', tc01);
    addhtml(file, 'a', '', ['при разомкнутой обмотке якоря ' ...
        'и короткозамкнутой обмотке возбуждения'], '%5.3f', td02);
    addhtml(file, 'a', '', ['при короткозамкнутых ' ...
        'обмотках якоря и возбуждения'], '%5.4f', td2);
    addhtml(file, 'a', '', ['Демпферной обмотки по поперечной оси' ...                             
    'при  разомкнутой обмотке якоря'], '%5.3f', tq01);
    addhtml(file, 'a', '', ['при короткозамкнутой обмотке якоря'], '%5.4f', tq2);

    addhtml(file, 'a', '', 'Отношение  короткого  замыкания', '%6.3f', okz);
    addhtml(file, 'a', '', 'Статическая  перегружаемость', '%6.2f', stover);
    addhtml(file, 'a', '', 'Термическая  стойкость  демпферной  обмотки', '%6.0f', terdem);
    addhtml(file, 'a', '', 'Емкость  обмотки  якоря', '%6.3f', c3f);
    addhtml(file, 'a', '', 'Емкость  фазы  обмотки  якоря', '%6.3f', c1f);
    addhtml(file, 'a', '', 'Емкость  обмотки  ротора', '%6.3f', crot);
    addhtml(file, 'a', '', 'Мощность  при  зарядке  линии', '%6.0f', qczar);


    h = ['<tr class="heighttr" align="center">\n<td colspan="2">' ...
        'Потери и КПД при номинальной нагрузке</td>\n</tr>\n'];
    addhtml(file, 'a', h, '', '', '');
    addhtml(file, 'a', '', ['Потери холостого хода'], '%5.2f', 0);
    addhtml(file, 'a', '', ['В спинке сердечника статора'], '%9.1f', pqa);
    addhtml(file, 'a', '', ['В зубцах сердечника статора'], '%9.1f', pqz);
    addhtml(file, 'a', '', ['На поверхности полюсных башмаков' ...
		'эквивалентная поверхность башмака'], '%9.1f', pqp0);
    addhtml(file, 'a', '', ['В торцевых зонах статора'], '%9.1f', pqt);
    addhtml(file, 'a', '', ['Добавочные в демпферных стержнях'], '%9.1f', pqc);
    addhtml(file, 'a', '', ['Суммарные потери в стали'], '%9.1f', pqfehh);
    addhtml(file, 'a', '', ['Вентиляционные'], '%9.1f', pqv);
    addhtml(file, 'a', '', ['Расход воздуха'], '%9.1f', raswoz);
    addhtml(file, 'a', '', ['Перегрев воздуха'], '%9.1f', tetwoz);
    addhtml(file, 'a', '', ['Расчетные в подпятнике'], '%9.1f', 0);
    addhtml(file, 'a', '', ['Сумма постоянных потерь'], '%9.1f', pqpost);
	
end